// --створити масив та вивести його в консоль:

// - з 5 числових значень
// let numbers = [12, 5, 7 ,9, 23];
// console.log(numbers);



// - з 5 стічкових значень
// let str = ["owu", "come","just", "true", "hello"];
// console.log(str);


// - з 5 значень стрічкового, числового та булевого типу
// let a1 = ["owu", false, 12, 15, "goodbye"];
// console.log(a1);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let arr = [];
// arr[0] = "hello";
// arr[1] = 1;
// arr[2] = true;
// arr[3] = "programmer";
// arr[4] = 5.222;
// console.log(arr);



// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// let text = '<div> текст </div>'
// for(let i = 0; i<10;i++) {
//     document.write(text)
//     console.log(i);
// }



// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// let text = '<div> '+' index = '+' текст'+'</div>'
// for(let i = 0; i<10;i++) {
//     document.write(text)
//     console.log(i);
// }



// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// let i = 0;
// while(i<=20) {
//     document.write("<h1>Текст<h1/>");
//     i++
//
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let i = 0;
// while(i<=20) {
//     document.write("i+ <h1>Текст<h1/>");
//     i++
//
// }
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let str = [12,15,16,18,20,200,56,12,8,10];
// for(let i = 0; i<str.length;i++) {
//     console.log(str[i]);
// }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let str = ["hello", "com", "google","meet", "angel","feel","text","fdfd","sdsd","dfdfdf"];
// for(let i = 0; i<str.length;i++) {
//      console.log(str[i]);
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let str = [12,"hello",16,true,20.5555,"happy",56,false,8,"gfgfd"];
// for(let i = 0; i<str.length;i++) {
//     console.log(str[i]);
// }


// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// let x = [true,'2',3,10,5,'6',true,'8',4,false];
// for (let i = 0 ; i < 10 ; i++){
//     if (typeof x[i] === "boolean") {
//         console.log(x[i])
//     }
// }



// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// let x = [true,'2',3,10,5,'6',true,'8',4,false];
// for (let i = 0 ; i < 10 ; i++){
//     if (typeof x[i] === "number") {
//         console.log(x[i])
//     }
// }

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// let x = [true,'2',3,10,5,'6',true,'8',4,false];
// for (let i = 0 ; i < 10 ; i++){
//     if (typeof x[i] === "string") {
//         console.log(x[i])
//     }
// }
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// let  a = ['a','b','3',true,false,12,15,14,"happy","fgfd"]
//  let str = ''
//  for(let i=0;i<a.length;i++){
//      str +=a[i]
//  }
//  console.log(str);


// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for(let i=0;i<10;i++){
//     console.log(i)
//     document.write(i + "<p>")
// }
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for(let i=0;i<100;i++){
//     console.log(i)
//      document.write(i + "<p>")
// }

// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// for(let i=0;i<100;i+=2){
//    console.log(i)
//     document.write(i  + "<p>")
// }


// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
//  for(let i=0;i<100;i+=2){
//    console.log(i/2)
//     document.write(i/2  + "<p>")
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//  for(let i=1;i<100;i+=2){
//    console.log(i/2)
//     document.write(i/2  + "<p>")
// }

// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// for (let m = 0; m < 60; m++) {
//     for (let s = 0; s < 60; s++) {
//         console.log(m + ":" + s);
//     }
//     if (minute == 2) {
//         break;
//     }
// }

    // - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// for(let h = 0;h<= 2;h++) {
//     for (let m = 0; m < 60; m++) {
//         for (let s = 0; s < 60; s++) {
//             console.log(h + ":" + m + ":" + s);
//
//             if (s == 0 && m == 20 && h == 2) {
//                 break;
//             }
//         }
//         if (hour == 2 && minute == 20) {
//             break;
//         }
//
//     }
// }
// Додатково

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// let  a = ['a','b','c']
// let str = ''
// for(let i=0;i<a.length;i++){
//     str +=a[i]
// }
// console.log(str)


// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// let arr = ['a', 'b', 'c'];
// let sum = '';
// let i = 0;
// while(i < arr.length) {
//     sum += arr[i];
//     i++;
// }
// console.log(sum);




// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// let arr = ['a', 'b', 'c'];
// let sum = '';
// for(let elem of arr){
//     sum += elem;
// }
// console.log(sum);


// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10. створити пустий масив та :
//     - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.




// 1. перебрати його циклом while

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = 0;
// while(i < arr.length){
//     console.log(arr[i]);
//     i++;
// }

// 2.  перебрати його циклом for

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for(i = 0; i < arr.length; i++){
//     console.log(arr[i]);
// }

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = 1;
// while (i < arr.length){
//     console.log(arr[i]);
//     i = i + 2;
// }

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for(i = 1; i < arr.length; i = i + 2){
//     console.log(arr[i]);
// }

// 5. перебрати циклом while та вивести  числа тільки парні  значення.

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = 0;
// while (i < arr.length){
//     console.log(arr[i]);
//     i = i + 2;
// }

// 6. перебрати циклом for та вивести  числа тільки парні  значення

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for(i = 0; i < arr.length; i = i + 2){
//     console.log(arr[i]);
// }

// 7. замінити кожне число кратне 3 на слово "okten"
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for(i = 0; i < arr.length; i++){
//     if(arr[i] % 3 === 0){
//         arr[i] = 'okten';
//     }
// }
// console.log(arr);

// 8. вивести масив в зворотньому порядку.

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let result = [];

// for (let i = arr.length-1; i >= 0; i--) {
//     result.push(arr[i]);
// }
// console.log(result);

// 9. ???

// 10.1 Заповнити масив непарними 50 числами

// let arr = [];
// for(let i = 1; i < 100; i = i + 2){
//     arr.push(i);
// }
// console.log(arr);

// 10.2 Зповнити масив парними 50 числами

// let arr = [];
// for(let i = 2; i <= 100; i = i + 2){
//     arr.push(i);
// }
// console.log(arr);